Feature: 지하철역 경로 찾기 기능

#     교대역    --- *2호선* ---   강남역
#     |                        |
#     *3호선*                   *신분당선*
#     |                        |
#     남부터미널역  --- *3호선* ---   양재
#     |                        |
#     *가상선*                   *신분당선*
#     |                        |
#     서울역  --- *가상선* ---   판교역
#     |
#     *천당선*
#     |
#     천당역
#
# 노선 별 추가요금
# 가상선 : 900원
# 천당선 : 2000원

  Background: 지하철 노선도 준비
    Given 지하철역들을 생성 요청하고
      | name   |
      | 교대역    |
      | 강남역    |
      | 양재역    |
      | 남부터미널역 |
      | 서울역 |
      | 판교역 |
      | 천당역 |
    And 지하철 노선들을 생성 요청하고
      | name | color  | upStation | downStation | distance | duration | addedFare | startTime | endTime | intervalTime |
      | 2호선  | green  | 교대역       | 강남역         | 10       | 3        | 0         | 05:00    | 23:00    | 10           |
      | 신분당선 | red    | 강남역       | 양재역         | 10       | 3        | 0         | 05:30    | 23:00    | 15           |
      | 3호선  | orange | 교대역       | 남부터미널역      | 2        | 5        | 0         | 06:00    | 23:00    | 5           |
      | 가상선  | blue | 남부터미널역       | 서울역      | 10        | 2        | 900        | 03:00    | 00:00    | 15           |
      | 천당선  | white | 서울역       | 천당역      | 87        | 88    | 2000            | 08:00    | 00:00    | 30           |
    And 지하철 구간을 등록 요청하고
      | lineName | upStation | downStation | distance | duration |
      | 3호선      | 남부터미널역    | 양재역         | 3        | 5        |
      | 가상선      | 서울역    | 판교역         | 3        | 3        |
      | 신분당선      | 양재역    | 판교역         | 3        | 5        |
    And 회원을 생성하고
      | email | password | age |
      | child@naver.com| 1111 | 10 |
      | teen@naver.com | 2222 | 17 |
      | adult@naver.com| 3333 | 31 |

  Scenario: 비회원이 두 역의 최단 거리 기준 경로를 조회한다 (10km이하)
    When 비회원이 "교대역"과 "양재역"의 최단 거리 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,양재역" 경로가 조회된다
    And 총 거리 5 응답한다
    And 소요 시간 10 응답한다
    And 이용 요금 1250 응답한다

  Scenario: 비회원이 두 역의 최단 거리 기준 경로를 조회한다 (10km이하)
    When 비회원이 "교대역"과 "판교역"의 최단 거리 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,양재역,판교역" 경로가 조회된다
    And 총 거리 8 응답한다
    And 소요 시간 15 응답한다
    And 이용 요금 1250 응답한다

  Scenario: 비회원이 두 역의 최단 거리 기준 경로를 조회한다 (50km초과, 추가요금 노선)
    When 비회원이 "교대역"과 "천당역"의 최단 거리 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,양재역,판교역,서울역,천당역" 경로가 조회된다
    And 총 거리 98 응답한다
    And 소요 시간 106 응답한다
    And 이용 요금 4650 응답한다

  Scenario: 비회원이 두 역의 최소 시간 기준 경로를 조회한다. (10km초과 50km미만)
    When 비회원이 "교대역"과 "양재역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,강남역,양재역" 경로가 조회된다
    And 총 거리 20 응답한다
    And 소요 시간 6 응답한다
    And 이용 요금 1450 응답한다

  Scenario: 비회원이 두 역의 최소 시간 기준 경로를 조회한다 (10km초과 50km미만, 추가요금 노선)
    When 비회원이 "교대역"과 "판교역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,서울역,판교역" 경로가 조회된다
    And 총 거리 15 응답한다
    And 소요 시간 10 응답한다
    And 이용 요금 2250 응답한다

  Scenario: 비회원이 두 역의 최소 시간 기준 경로를 조회한다 (50km초과, 추가요금 노선)
    When 비회원이 "교대역"과 "천당역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,서울역,천당역" 경로가 조회된다
    And 총 거리 99 응답한다
    And 소요 시간 95 응답한다
    And 이용 요금 4750 응답한다

  Scenario: 청소년이 두 역의 최소 시간 기준 경로를 조회한다. (10km초과 50km미만)
    Given 이메일 "teen@naver.com"과 비밀번호 "2222"로 로그인하고
    When 회원이 "교대역"과 "양재역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,강남역,양재역" 경로가 조회된다
    And 총 거리 20 응답한다
    And 소요 시간 6 응답한다
    And 이용 요금 880 응답한다

  Scenario: 청소년이 두 역의 최소 시간 기준 경로를 조회한다 (50km초과, 추가요금 노선)
    Given 이메일 "teen@naver.com"과 비밀번호 "2222"로 로그인하고
    When 회원이 "교대역"과 "천당역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,서울역,천당역" 경로가 조회된다
    And 총 거리 99 응답한다
    And 소요 시간 95 응답한다
    And 이용 요금 3520 응답한다

  Scenario: 어린이가 두 역의 최소 시간 기준 경로를 조회한다. (10km초과 50km미만)
    Given 이메일 "child@naver.com"과 비밀번호 "1111"로 로그인하고
    When 회원이 "교대역"과 "양재역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,강남역,양재역" 경로가 조회된다
    And 총 거리 20 응답한다
    And 소요 시간 6 응답한다
    And 이용 요금 550 응답한다

  Scenario: 어린이가 두 역의 최소 시간 기준 경로를 조회한다 (50km초과, 추가요금 노선)
    Given 이메일 "child@naver.com"과 비밀번호 "1111"로 로그인하고
    When 회원이 "교대역"과 "천당역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,서울역,천당역" 경로가 조회된다
    And 총 거리 99 응답한다
    And 소요 시간 95 응답한다
    And 이용 요금 2200 응답한다

  Scenario: 성인이 두 역의 최소 시간 기준 경로를 조회한다. (10km초과 50km미만)
    Given 이메일 "adult@naver.com"과 비밀번호 "3333"로 로그인하고
    When 회원이 "교대역"과 "양재역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,강남역,양재역" 경로가 조회된다
    And 총 거리 20 응답한다
    And 소요 시간 6 응답한다
    And 이용 요금 1450 응답한다

  Scenario: 성인이 두 역의 최소 시간 기준 경로를 조회한다 (50km초과, 추가요금 노선)
    Given 이메일 "adult@naver.com"과 비밀번호 "3333"로 로그인하고
    When 회원이 "교대역"과 "천당역"의 최소 시간 기준으로 경로를 조회하면
    Then "교대역,남부터미널역,서울역,천당역" 경로가 조회된다
    And 총 거리 99 응답한다
    And 소요 시간 95 응답한다
    And 이용 요금 4750 응답한다

#  Scenario: 성인이 두 역의 가장 빠른 도착 경로를 조회한다 (10km이하)
#    Given 이메일 "adult@naver.com"과 비밀번호 "3333"로 로그인하고
#    When 회원이 "202501130550"에 "교대역"과 "양재역"의 가장 빠른 도착 경로를 조회하면
#    Then "교대역,강남역,양재역" 경로가 조회된다
#    And 총 거리 20 응답한다
#    And 소요 시간 6 응답한다
#    And 이용 요금 1250 응답한다
#    And 도착시간 202501130603 응답한다
#
#
#  Scenario: 성인이 두 역의 가장 빠른 도착 경로를 조회한다 (10km이하)
#    Given 이메일 "adult@naver.com"과 비밀번호 "3333"로 로그인하고
#    When 회원이 "202501130604"에 "교대역"과 "양재역"의 가장 빠른 도착 경로를 조회하면
#    Then "교대역,남부터미널역,양재역" 경로가 조회된다
#    And 총 거리 5 응답한다
#    And 소요 시간 10 응답한다
#    And 이용 요금 1250 응답한다
#    And 도착시간 202501130615 응답한다
#
#  Scenario: 성인이 두 역의 가장 빠른 도착 경로를 조회한다 (10km이하)
#    Given 이메일 "adult@naver.com"과 비밀번호 "3333"로 로그인하고
#    When 회원이 "202501132300"에 "교대역"과 "양재역"의 가장 빠른 도착 경로를 조회하면
#    Then "교대역,남부터미널역,양재역" 경로가 조회된다
#    And 총 거리 5 응답한다
#    And 소요 시간 10 응답한다
#    And 이용 요금 1250 응답한다
#    And 도착시간 202501132310 응답한다
#
#  Scenario: 성인이 두 역의 가장 빠른 도착 경로를 조회한다 (10km이하)
#    Given 이메일 "adult@naver.com"과 비밀번호 "3333"로 로그인하고
#    When 회원이 "202501132301"에 "교대역"과 "양재역"의 가장 빠른 도착 경로를 조회하면
#    Then "교대역,강남역,양재역" 경로가 조회된다
#    And 총 거리 20 응답한다
#    And 소요 시간 6 응답한다
#    And 이용 요금 1250 응답한다
#    And 도착시간 202501140533 응답한다